/* package up error # */
"error %1$d" = "feil %1$d";
"error %1$#x" = "feil %1$#x";
/* errno error 0 */
"Unknown error: 0" = "Ukjent feil: 0";

/* errno error 1 */
"Operation not permitted" = "Operasjonen er ikke tillatt";

/* errno error 2 */
"No such file or directory" = "Filen eller katalogen finnes ikke";

/* errno error 3 */
"No such process" = "Prosessen finnes ikke";

/* errno error 4 */
"Interrupted system call" = "Avbrutt systemkall";

/* errno error 5 */
"Input/output error" = "Inn-/utdatafeil";

/* errno error 6 */
"Device not configured" = "Enhet ikke konfigurert";

/* errno error 7 */
"Argument list too long" = "Argumentlisten er for lang";

/* errno error 8 */
"Exec format error" = "Exec format-feil";

/* errno error 9 */
"Bad file descriptor" = "Ugyldig fildeskriptor";

/* errno error 10 */
"No child processes" = "Ingen underordnede prosesser";

/* errno error 11 */
"Resource deadlock avoided" = "Ressursvranglås unngått";

/* errno error 12 */
"Cannot allocate memory" = "Kan ikke tildele hukommelse";

/* errno error 13 */
"Permission denied" = "Ingen tilgang";

/* errno error 14 */
"Bad address" = "Ugyldig adresse";

/* errno error 15 */
"Block device required" = "Blokkenhet nødvendig";

/* errno error 16 */
"Resource busy" = "Ressurs opptatt";

/* errno error 17 */
"File exists" = "Filen finnes";

/* errno error 18 */
"Cross-device link" = "Cross-device-kobling";

/* errno error 19 */
"Operation not supported by device" = "Operasjonen støttes ikke av enheten";

/* errno error 20 */
"Not a directory" = "Ikke en katalog";

/* errno error 21 */
"Is a directory" = "Er en katalog";

/* errno error 22 */
"Invalid argument" = "Ugyldig argument";

/* errno error 23 */
"Too many open files in system" = "For mange åpne filer i systemet";

/* errno error 24 */
"Too many open files" = "For mange åpne filer";

/* errno error 25 */
"Inappropriate ioctl for device" = "Feil «ioctl» for enhet";

/* errno error 26 */
"Text file busy" = "Tekstfil opptatt";

/* errno error 27 */
"File too large" = "Filen er for stor";

/* errno error 28 */
"No space left on device" = "Ingen ledig plass på enheten";

/* errno error 29 */
"Illegal seek" = "Ulovlig søk";

/* errno error 30 */
"Read-only file system" = "Kun-les-filsystem";

/* errno error 31 */
"Too many links" = "For mange koblinger";

/* errno error 32 */
"Broken pipe" = "Ugyldig «pipe»";

/* errno error 33 */
"Numerical argument out of domain" = "Numerisk argument utenfor domenet";

/* errno error 34 */
"Result too large" = "Resultat for stort";

/* errno error 35 */
"Resource temporarily unavailable" = "Ressurs midlertidig utilgjengelig";

/* errno error 36 */
"Operation now in progress" = "Operasjonen er i gang";

/* errno error 37 */
"Operation already in progress" = "Operasjonen er allerede i gang";

/* errno error 38 */
"Socket operation on non-socket" = "Identifikatoroperasjon på ikke-identifikator";

/* errno error 39 */
"Destination address required" = "Måladresse kreves";

/* errno error 40 */
"Message too long" = "Melding for lang";

/* errno error 41 */
"Protocol wrong type for socket" = "Feil protokolltype for forbindelse";

/* errno error 42 */
"Protocol not available" = "Protokoll ikke tilgjengelig";

/* errno error 43 */
"Protocol not supported" = "Protokoll støttes ikke";

/* errno error 44 */
"Socket type not supported" = "Identifikatortype støttes ikke";

/* errno error 45 */
"Operation not supported" = "Operasjonen støttes ikke";

/* errno error 46 */
"Protocol family not supported" = "Protokollfamilien støttes ikke";

/* errno error 47 */
"Address family not supported by protocol family" = "Adressefamilien støttes ikke av protokollfamilien";

/* errno error 48 */
"Address already in use" = "Adressen er allerede i bruk";

/* errno error 49 */
"Can't assign requested address" = "Kan ikke tildele adresse";

/* errno error 50 */
"Network is down" = "Nettverket er nede";

/* errno error 51 */
"Network is unreachable" = "Nettverket kan ikke nås";

/* errno error 52 */
"Network dropped connection on reset" = "Nettverket mistet forbindelsen ved nullstilling";

/* errno error 53 */
"Software caused connection abort" = "Programvaren forårsaket forbindelsesavbrudd";

/* errno error 54 */
"Connection reset by peer" = "Forbindelsen ble nullstilt";

/* errno error 55 */
"No buffer space available" = "Ingen bufferplass tilgjengelig";

/* errno error 56 */
"Socket is already connected" = "Identifikator er allerede tilkoblet";

/* errno error 57 */
"Socket is not connected" = "Identifikator er ikke tilkoblet";

/* errno error 58 */
"Can't send after socket shutdown" = "Kan ikke sende etter «socket shutdown»";

/* errno error 59 */
"Too many references: can't splice" = "For mange referanser: kan ikke skjøte";

/* errno error 60 */
"Operation timed out" = "Operasjonen ble tidsavbrutt";

/* errno error 61 */
"Connection refused" = "Forbindelse avvist";

/* errno error 62 */
"Too many levels of symbolic links" = "For mange nivåer med symbolske koblinger";

/* errno error 63 */
"File name too long" = "Filnavnet er for langt";

/* errno error 64 */
"Host is down" = "Verten er nede";

/* errno error 65 */
"No route to host" = "Ingen rute til verten";

/* errno error 66 */
"Directory not empty" = "Katalog ikke tom";

/* errno error 67 */
"Too many processes" = "For mange prosesser";

/* errno error 68 */
"Too many users" = "For mange brukere";

/* errno error 69 */
"Disc quota exceeded" = "Diskkvote overskredet";

/* errno error 70 */
"Stale NFS file handle" = "Utgått NFS-filalias";

/* errno error 71 */
"Too many levels of remote in path" = "For mange eksterne nivåer i bane";

/* errno error 72 */
"RPC struct is bad" = "Ødelagt RPC-struktur";

/* errno error 73 */
"RPC version wrong" = "Feil RPC-versjon";

/* errno error 74 */
"RPC prog. not avail" = "RPC-prog. ikke tilgj.";

/* errno error 75 */
"Program version wrong" = "Feil programversjon";

/* errno error 76 */
"Bad procedure for program" = "Ugyldig prosedyre for program";

/* errno error 77 */
"No locks available" = "Ingen lås tilgjengelig";

/* errno error 78 */
"Function not implemented" = "Funksjonen er ikke implementert";

/* errno error 79 */
"Inappropriate file type or format" = "Feil filtype eller -format";

/* errno error 80 */
"Authentication error" = "Autentiseringsfeil";

/* errno error 81 */
"Need authenticator" = "Godkjenning kreves";

/* errno error 82 */
"Device power is off" = "Enhet er slått av";

/* errno error 83 */
"Device error" = "Enhetsfeil";

/* errno error 84 */
"Value too large to be stored in data type" = "Verdi for stor til å lagres i datatype";

/* errno error 85 */
"Bad executable (or shared library)" = "Ugyldig utførbar fil (eller delt bibliotek)";

/* errno error 86 */
"Bad CPU type in executable" = "Ugyldig CPU-type i utførbar fil";

/* errno error 87 */
"Shared library version mismatch" = "Delt bibliotek-versjoner stemmer ikke overens";

/* errno error 88 */
"Malformed Mach-o file" = "Feil format for Mach-o-filen";

/* errno error 89 */
"Operation canceled" = "Handling avbrutt";

/* errno error 90 */
"Identifier removed" = "Identifikator fjernet";

/* errno error 91 */
"No message of desired type" = "Ingen melding av ønsket type";

/* errno error 92 */
"Illegal byte sequence" = "Ulovlig bytesekvens";

/* errno error 93 */
"Attribute not found" = "Attributt ikke funnet";

/* errno error 94 */
"Bad message" = "Ugyldig melding";

/* errno error 95 */
"EMULTIHOP (Reserved)" = "EMULTIHOP (reservert)";

/* errno error 96 */
"No message available on STREAM" = "Ingen melding tilgjengelig på STREAM";

/* errno error 97 */
"ENOLINK (Reserved)" = "ENOLINK (reservert)";

/* errno error 98 */
"No STREAM resources" = "Ingen STREAM-ressurser";

/* errno error 99 */
"Not a STREAM" = "Ikke en STREAM";

/* errno error 100 */
"Protocol error" = "Protokollfeil";

/* errno error 101 */
"STREAM ioctl timeout" = "STREAM ioctl-tidsavbrudd";

/* errno error 102 */
"Operation not supported on socket" = "Operasjonen støttes ikke av socket";

/* errno error 103 */
"Policy not found" = "Fant ikke kriterium";
